Ruby/Ruby/FundamentosRails/sistemajat/app/views/welcome/index.html.erb

                   <div class="field form-group">
                   <%= collection_select :user, :rol_id , Rol.all, :id, :nombre, :prompt => true  %>
---
SELECT "rols".* FROM "rols"