Ruby/Ruby/FundamentosRails/sistemajat/app/controllers/drivers_controller.rb

  def index
    @drivers = Driver.all
---
SELECT "drivers".* FROM "drivers"

  def create
    @driver = Driver.new(driver_params)
    @user = User.find_by(id: session[:user_id])
    @rol = Rol.find_by(id: @user.rol_id)
    @driver = Driver.create(rut: @driver.rut)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "rols".* FROM "rols" WHERE "rols"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "drivers" ("rut", "habilitado", "rol_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["rut", "187526345"], ["habilitado", "false"], ["rol_id", 2], ["user_id", 3], ["created_at", "2021-08-12 23:48:33.751710"], ["updated_at", "2021-08-12 23:48:33.751710"]]

  def destroy
    @driver.destroy
---
DELETE FROM "drivers" WHERE "drivers"."id" = ?  [["id", 1]]

    def set_driver
      @driver = Driver.find(params[:id])
---
SELECT "drivers".* FROM "drivers" WHERE "drivers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]