Ruby/Ruby/FundamentosRails/sistemajat/app/controllers/solicituds_controller.rb

SELECT "solicituds".* FROM "solicituds"
---
  def index
    @solicituds = Solicitud.all

INSERT INTO "solicituds" ("origen", "destino", "hora", "titulo", "descripcion", "monto_sugerido", "oferta_driver", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @solicitud = Solicitud.new(solicitud_params)

    respond_to do |format|
      if @solicitud.save

DELETE FROM "solicituds" WHERE "solicituds"."id" = ?  [["id", 2]]
---
  def destroy
    @solicitud.destroy

SELECT "solicituds".* FROM "solicituds" WHERE "solicituds"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_solicitud
      @solicitud = Solicitud.find(params[:id])