Ruby/Ruby/FundamentosRails/sistemajat/app/controllers/users_controller.rb

INSERT INTO "users" ("nombre", "apellido", "email", "password_digest", "rol_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(parametros_user)
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def show
    @user = User.find_by(id: session[:user_id])